# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [4]:
# Your code here; import the necessary packages
import sqlite3
import pandas as pd

In [5]:
# Your code here; create the connection and cursor
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Write an Equivalent Query using a Subquery

```SQL
SELECT customerNumber,
       contactLastName,
       contactFirstName
       FROM customers
       JOIN orders 
       USING(customerNumber)
       WHERE orderDate = '2003-01-31';
```

In [6]:
# Your code here; use a subquery. No join is necessary 
cur.execute("""SELECT customerNumber, contactLastName, contactFirstName
                FROM customers WHERE customerNumber in
                (SELECT customerNumber FROM orders WHERE orderDate = '2003-01-31')""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [13]:
# Your code here
cur.execute("""SELECT count(orderNumber), productCode
                FROM orderdetails WHERE productCode in
                (SELECT productCode FROM products) GROUP by productCode ORDER by productCode, count(orderNumber)""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

     count(orderNumber) productCode
0                    28    S10_1678
1                    28    S10_1949
2                    28    S10_2016
3                    28    S10_4698
4                    28    S10_4757
..                  ...         ...
104                  27   S700_3505
105                  27   S700_3962
106                  28   S700_4002
107                  28    S72_1253
108                  27    S72_3212

[109 rows x 2 columns]

In [14]:
cur.execute("""SELECT productCode, productName
                FROM products WHERE productCode in
                (SELECT DISTINCT(productCode) FROM products) GROUP by productCode ORDER by productCode""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

    productCode                            productName
0      S10_1678  1969 Harley Davidson Ultimate Chopper
1      S10_1949               1952 Alpine Renault 1300
2      S10_2016                  1996 Moto Guzzi 1100i
3      S10_4698   2003 Harley-Davidson Eagle Drag Bike
4      S10_4757                    1972 Alfa Romeo GTA
..          ...                                    ...
105   S700_3505                            The Titanic
106   S700_3962                         The Queen Mary
107   S700_4002              American Airlines: MD-11S
108    S72_1253                       Boeing X-32A JSF
109    S72_3212                             Pont Yacht

[110 rows x 2 columns]

In [17]:
cur.execute("""SELECT count(distinct(productCode))
                FROM products""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   count(distinct(productCode))
0                           110

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [20]:
# Your code here:
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT
cur.execute("""SELECT p.productName, count(c.customerNumber)
                FROM products  p, customers c WHERE productCode in
                (SELECT DISTINCT(productCode) FROM orderdetails WHERE orderNumber in 
                (SELECT orderNumber from orders WHERE customerNumber in (SELECT customerNumber FROM customers)))
                GROUP BY p.productCode""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

OperationalError: no such column: p.productNumber

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products Which Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
# Your code here

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit of Over 15K

In [ ]:
# Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!